---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData.Dispose
source: html/cb06a351-8ccc-0dd0-2029-6976210515ec.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData.Dispose Method

Releases all resources used by the DuctFittingAndAccessoryPressureDropUIData

## Syntax (C#)
```csharp
public void Dispose()
```